{
/*

https://stardewvalleywiki.com/Modding:Dialogue

https://github.com/Pathoschild/StardewMods/blob/develop/ContentPatcher/docs/author-guide/tokens.md

"$c 0.5#first dialogue#second dialogue" is the randomized way built into vanilla. 
"{{I18n:dialogue.npc.{{random:1,2,3}} }}" with keys for dialogue.npc.1, dialogue.npc.2 etc in the i18n default folder is how you can do it in i18n very easily.

*/


//Gifts
    "AcceptBirthdayGift.IridiumBar.1": "Oh! This is very useful, thank you.$1",
    "AcceptBirthdayGift.mineral.1": "This looks delicious, thank you.$1",


// DISPOSITION
    "Siva.Gift.Love.1": "A perfect crystalline structure! The molecular resonance... it's exquisite.$4 This will make a delightful afternoon snack.$1",

    "Siva.Gift.Like.1": "Hmm, interesting mineral composition. Not my preferred flavor profile, but certainly palatable.$7 Thank you.$1",

    "Siva.Gift.Neutral.1": "An object. For me. I see.$0 Cultural exchange protocols indicate I should express gratitude, so... thank you?$3",

    "Siva.Gift.Dislike.1": "I appreciate the gesture, but this item contains concerning levels of organic matter.$6 My digestive system strongly objects.$8",

    "Siva.Gift.Hate.1": "This appears to be mostly water with impurities.$8 My species considers this somewhere between 'inedible' and 'mildly offensive.'$5",

    "Siva.Gift.IridiumBar.1": "Iridium! Wonderful!$4 The resonant properties will significantly enhance my communication array. And it's quite delicious.$1",

    "Siva.Gift.Mineral.1": "Ah! Earth minerals have such unique vibrational signatures.$7 The flavor profile is... let's say 'rustic' compared to home, but charming.$3",


// CTs

    "Siva.Dialogue.Introduction": "I am Siva, recently... relocated from considerably further away than you might guess.$3 Mr. Qi has provided temporary employment while I repair my vessel. Blik and I are adapting to your curious customs.$1",

    "Siva.Dialogue.Resort_Entering.1": "A recreational water facility. How quaint.$7 I should warn you my epidermis may temporarily change your pool's pH balance.$3",

    "Siva.Dialogue.Resort_Shore.1": "I'm observing from a safe distance.$0 Large bodies of water and my internal systems have... disagreements.$8",

    "Siva.Dialogue.Movie_Invitation.1": "A visual narrative experience? Intriguing.$7 On my world, we share stories through crystalline thought-transference, but I'm eager to try your method.$4",

    "Siva.Dialogue.cc_Complete.1": "You've restored this community gathering place.$0 Fascinating how physical spaces influence social coherence.$7 Perhaps there's something to learn from your species after all.$10",

    "Siva.Dialogue.danceAccept.1": "A ritualized movement ceremony? I suppose I could analyze your planet's rhythmic traditions firsthand.$7 For scientific purposes, of course.$3",
    
    "Siva.Dialogue.danceRejection.1": "...$1",
    
    "Siva.Dialogue.GreenRain.1": "...$1",
    
    "Siva.Dialogue.GreenRainFinished.1": "...$1",
    
    "Siva.Dialogue.GreenRain_2.1": "...$1",
    
    "Siva.Dialogue.Resort_Leaving.1": "...$1",
    
    "Siva.Dialogue.Resort_Chair.1": "...$1",
    
    "Siva.Dialogue.Resort_Bar.1": "...$1",
    
    "Siva.Dialogue.Resort.1": "...$1",
    
    "Siva.Dialogue.Resort_Towel.1": "...$1",
    
    "Siva.Dialogue.Resort_Umbrella.1": "...$1",
    
    "Siva.Dialogue.Resort_Wander.1": "...$1",
    
    "Siva.Dialogue.cc_Begin.1": "...$1",
    
    "Siva.Dialogue.cc_Boulder.1": "...$1",
    
    "Siva.Dialogue.cc_Bridge.1": "...$1",
    
    "Siva.Dialogue.cc_Bus.1": "...$1",
    
    "Siva.Dialogue.cc_Greenhouse.1": "...$1",

    "Siva.Dialogue.movieTheater.1": "...$1",
    
    "Siva.Dialogue.luauBest.1": "...$1",
    
    "Siva.Dialogue.luauShorts.1": "...$1",
    
    "Siva.Dialogue.luauPoisoned.1": "...$1",

//Config//
    "Config.Unwipeable.name": "Unwipeable",
    
    "Config.Unwipeable.description": "Default true to have Siva's memory be unwipeable from the witch statue.",
    
    "Config.Qi Title.name": "Qi Title",
    
    "Config.Qi Title.description": "Sets the title for Qi.",

//Music
    "Siva.Music.Workshop": "Shimmering Nebulae (void1gaming)",
    
    "Siva.Music.Date": "Carnival Date (JStewartMusic)",


//Blik Dialogue
    "Blik.Damage.01": "Blik was being particularly playful today. He {{BlikDamageAction}} my {{BlikObjectTarget}}! I'm glad he's having fun. $1",

    "Blik.Exploration.01": "I caught Blik {{BlikMovementAction}} {{BlikTownLocation}}. I think he was {{BlikCuriosityAction}} something new. $1",

    "Blik.Play.01": "Blik found a {{BlikCreatureTarget}} and decided to {{BlikPlayAction}} it. I'm glad he's making friends. $1",

    "Blik.Desert.01": "I found Blik {{BlikExploreAction}} {{BlikDesertLocation}}. He seems fascinated by the desert environment. $1",
    "Blik.Villager.01": "Blik {{BlikInteractionAction}} a {{BlikVillager}} today. I'm sure they were delighted by his curiosity. $1",
    "Blik.Curiosity.01": "Blik {{BlikCuriosityAction}} {{BlikTownLocation}}. I think he's always looking for new things to learn. $1",
    "Blik.Damage.02": "Blik {{BlikMovementAction}} {{BlikTownLocation}} and {{BlikDamageAction}} a {{BlikObjectTarget}}. I'll help him clean up the mess. $1",

    "Blik.Play.02": "I found Blik {{BlikPlayAction}} a {{BlikCreatureTarget}}. He's such a gentle soul. $1",

    "Blik.Desert.02": "Blik {{BlikExploreAction}} {{BlikDesertLocation}} and brought back a {{BlikCreatureTarget}}. I'm sure he'll take good care of it. $1",

    "Blik.Villager.02": "I caught Blik {{BlikInteractionAction}} a {{BlikVillager}}. I'm sure they were charmed by his friendly nature. $1",

    "Blik.Curiosity.02": "Blik {{BlikCuriosityAction}} {{BlikTownLocation}} and found a {{BlikObjectTarget}}. I'm sure he'll figure out what it does. $1",

    "Blik.Desert.03": "Blik {{BlikMovementAction}} {{BlikDesertLocation}} and came back with a {{BlikCreatureTarget}}. He's always bringing home new friends. $1",

    "Blik.Damage.03": "Blik reconfigured the molecular structure of my {{BlikObjectTarget}} today.$6 The locals would call it 'destruction,' but he's simply expressing his creativity... destructively.$3",

    "Blik.Exploration.02": "I tracked Blik's quantum signature to {{BlikTownLocation}} today.$7 He was systematically confusing the local fauna. A hobby of his.$3",

    "Blik.Villager.03": "Blik attempted first contact with {{BlikVillager}} today.$0 They mistook his interdimensional awareness for 'cute' behavior. His dignity is wounded.$6",

    "Blik.Curiosity.03": "Blik has taken to observing {{BlikVillager}} with particular interest.$7 I fear he's developing what humans might call 'affection.'$11 Most concerning.$0",
    

//Siva's Chef Dialogue
    "Siva.Chef.01": "Today I'm preparing a light refraction soufflé with prismatic shard garnish for {{ModConfig:Qi Title}}.$7 He doesn't actually eat it—just enjoys the chromatic display.$3 Such a waste of good minerals.$6",

    "Siva.Chef.02": "I've been experimenting with different crystalline structures in my cooking.$0 Amethyst brings out a subtle sweetness when properly illuminated, while topaz has a more... zesty quality.$4 {{ModConfig:Qi Title}} pretends to understand the difference.$3",

    "Siva.Chef.03": "{{ModConfig:Qi Title}} requested 'something blue' for dinner tonight.$0 I'm filtering moonlight through aquamarine at precisely 247 Kelvins.$7 Humans and their arbitrary food preferences are endlessly fascinating.$1",

    "Siva.Chef.04": "Did you know that light filtered through ruby tastes completely different depending on the star it originated from?$4 Of course, {{ModConfig:Qi Title}} can't appreciate such subtleties with his limited sensory apparatus.$6",

    "Siva.Chef.05": "I prepared a seven-course light tasting for {{ModConfig:Qi Title}} yesterday.$7 He sat through the entire presentation before reminding me that humans can't consume photonic energy.$6 I knew that.$5 It was... performance art.$3",

    "Siva.Chef.06": "{{ModConfig:Qi Title}}'s fascination with my culinary practices borders on the anthropological.$0 He watches me consume light through different minerals, taking notes.$3 I may be deliberately exaggerating certain reactions for his entertainment.$4",

    "Siva.Chef.07": "The desert sunlight filtered through emerald makes for a refreshing breakfast.$1 {{ModConfig:Qi Title}} tried to replicate the process with a flashlight and green bottle.$8 I didn't have the heart to tell him how wrong that was.$3",

    "Siva.Chef.08": "{{ModConfig:Qi Title}} asked me to prepare something 'normal' today.$0 I arranged a volcanic quartz in sunlight at the precise angle to produce the vibrational equivalent of your 'toast'.$7 He seemed... grateful, if confused.$3",

    "Siva.Chef.09": "I've started labeling my mineral collection as 'Breakfast,' 'Lunch,' and 'Dinner.'$4 {{ModConfig:Qi Title}} finds this hilarious for some reason.$0 Earth humor continues to elude me.$6",

    "Siva.Chef.10": "{{ModConfig:Qi Title}} tried to 'surprise' me with a jade specimen for my 'cooking.'$7 Little does he know that particular mineral composition produces what you might call an 'extremely acquired taste.'$6 I accepted graciously.$3",

    "Siva.Chef.11": "I'm perfecting a new recipe today.$4 Moonlight through obsidian, with a hint of geode-filtered starlight as garnish.$7 {{ModConfig:Qi Title}} calls it 'watching me eat rocks in the dark.'$6 A philistine's perspective.$3",

    "Siva.Chef.12": "{{ModConfig:Qi Title}} keeps asking if I can make 'alien food' for his human guests.$0 I tried explaining that my idea of a feast would give them radiation poisoning.$8 He still seems disappointed.$6",

    "Siva.Chef.13": "The desert's quartz deposits have a distinctive terroir.$7 Light filtered through them carries notes of ancient seabeds and long-forgotten volcanic activity.$4 It pairs wonderfully with afternoon sunlight.$1",

    "Siva.Chef.14": "I found Blik attempting to 'cook' by placing random objects in moonlight.$6 His culinary instincts need refinement, but I appreciate his cultural interest.$10",

    "Siva.Chef.15": "{{ModConfig:Qi Title}} asked me to cater his next mysterious gathering.$0 I'm preparing a stunning visual symphony of light refractions.$4 The humans will appreciate the display, even if they can't taste it.$7",

//Seasonal

//Spring
    "Siva.Spring.1": "Ah, another season has arrived. How marvelous! The sun has not yet abandoned us. $1",

    "Siva.Spring.2": "I once observed a star collapse into a supernova. $1 It was... magnificent, but there is something far more comforting about the steady pulse of life in your world. $1",
    
    "Siva.Spring.3": "You know, there is something quite beautiful about the way your world turns. It may be a slow dance, but it is a dance nonetheless. $1",
    
    "Siva.Spring.4": "The heat here is... intense. It is a reminder of how fragile we are, standing beneath the unyielding sun. In space, the heat is far more... dangerous. Here, it feels more like a challenge. $1",
    
    "Siva.Spring.5": "Ah, a fracture in the quartz-based lattice array again... It's always the trigonal systems that prove finicky under solar compression. I'll have it stabilized by dusk. $1",
    
    "Siva.Spring.6": "The Calico Desert... a place of dry winds and endless sand. It feels both desolate and serene, as though the planet itself is breathing, slowly, patiently. $1",
    
    "Siva.Spring.13": "Ah, another day has arrived. How marvelous! The sun has not yet abandoned us, and for that, I am grateful. Let us see what wonders this place holds. $1",
    
    "Siva.Spring.14": "I have traveled across vast stretches of space, through nebulae and asteroid fields, yet it is here, amidst the falling leaves, that I find a sense of peace. How strange, how wonderful. $1",
    
    "Siva.Spring.15": "Sometimes, when the sun is high, I feel as if I am in the heart of a star itself—burning brightly, surrounded by an expanse of heat. It's a strange but comforting feeling. $1",
    
    "Siva.Spring.16": "On my home world, we never felt the crispness of fall air. But here, I feel it in my very core, like a connection to this place itself. How incredible it is that something so simple can feel so grounding. $1",
    
    "Siva.Spring.17": "The desert reminds me of the great voids of space, where nothingness reigns. Yet here, life has found a way to survive. It's a fascinating contradiction, isn't it? $1",
    
    "Siva.Spring.18": "In the desert, the earth does not yield easily. It's as though the soil is holding onto its secrets, hiding them beneath layers of sand. A stark contrast to the easy embrace of life found elsewhere. $1",
    
    "Siva.Spring.19": "I often think about the lightyears of space that stretch out beyond the stars. So much empty space... yet, in this moment, here in your world, everything feels so... connected. $1",
    
    "Siva.Spring.20": "When I look up at the stars, I think of the millions of other worlds that exist out there, some teeming with life, others completely barren. Yet, here in this place, in the quiet of winter, I feel as though I've found something rare, something real. $1",
    
    "Siva.Spring.21": "The desert does not experience fall the way other places do, but there is a subtle change in the air. The winds grow cooler, as if the planet itself is taking a breath before winter arrives. $1",
    
    "Siva.Spring.22": "Space is cold. The void between stars is inhospitable, silent, and lifeless. But here in your world, the chill of winter somehow feels welcoming, like the planet is offering its own kind of warmth. $1",
    
    "Siva.Spring.23": "I come from a place where the sky is not blue, but a deep, endless black, dotted with the faintest glimmers of distant suns. Yet here, the air is full of life, and I find comfort in its simple rhythm. $1",
    
    "Siva.Spring.24": "In space, there are no seasons. No changes in the atmosphere. Here, in your world, these subtle shifts remind me of how delicate and precious life can be. A beautiful contrast to the harshness of space. $1",
    
    "Siva.Spring.25": "You know, there is something quite beautiful about the way your world turns. It may be a slow dance, but it is a dance nonetheless.",
    
    "Siva.Spring.27": "The Calico Desert... a place of dry winds and endless sand. It feels both desolate and serene, as though the planet itself is breathing, slowly, patiently. $1",
    
    "Siva.Spring.28": "Snow... The way it falls in such delicate patterns, each flake a unique structure of water crystals. It reminds me of the complexity of the universe, but here, it's so simple, so pure. $1",
    
    "Siva.Weather.Spring.1": "First day of spring and already this planet's vegetation erupts with alarming enthusiasm. Fascinating how life here is so... eager.$7",
    
    "Siva.Weather.Spring.2": "I once witnessed a neutron star's magnetic field tear apart a companion sun. Yet I find myself more moved by these simple wildflowers. How peculiarly sentimental I've become.$10",
   
    "Siva.Weather.Spring.3": "Your farmer friends celebrate tilling soil while I'm calibrating quantum phase arrays for Qi. To each species their passions, I suppose.$3",
    
    "Siva.Weather.Spring.4": "The molecular composition of spring rain differs subtly from winter precipitation. Blik seems to think both varieties taste identical. He's wrong, of course.$6",
    
    "Siva.Weather.Spring.5": "This planet's seasonal cycles are remarkably stable. My homeworld orbited binary stars—we had what you might call 'creative' seasons.$1",
    
    "Siva.WeatherSpring.13": "Found Blik attempting to communicate with local birds again. Their neural capacity is insufficient for his concepts, but I admire his optimism.$10",
    
    "Siva.WeatherSpring.17": "Mr. Qi requested another 'impossible' repair today. I completed it before lunch. The truly impossible part was explaining the process in terms he'd understand.$3",
    
    "Siva.WeatherSpring.23": "Desert mornings carry particular mineral notes in the air. Almost reminds me of home... if home were vastly cooler and disappointingly oxygenated.$0",
    
    "Siva.WeatherSpring.rain.1": "%Rain gives the minerals a pleasant sheen here. On my world, precipitation would dissolve most of your buildings.$7",

//Summer
    "Siva.Summer.1": "The thermal readings remind me of home, though far less extreme. My cooling systems barely need to engage.$1",
    
    "Siva.Summer.2": "{{TimeOfDay}} heat levels are {{Random:pleasant|mild}} compared to home. %If:IsHot:Thermal regulators at 5%% capacity%$1",
    
    "Siva.Summer.3": "The {{Weather}} intensity requires {{SivaTechTerm}} recalibration. %If:IsHot:Coolant systems engaged%$1",
    
    "Siva.Summer.4": "Summer {{TimeOfDay}} brings {{Random:warmth|gentle radiation}}. {{Random:Home's star would scorch this landscape|My systems barely notice}} $1",
    
    "Siva.Summer.5": "Summer's heat is {{Random:a cool breeze|refreshing}} compared to my homeworld's {{Random:molten seas|scorching winds}}. %If:IsStormy:The lightning reminds me of plasma storms%$1",
    
    "Siva.Summer.6": "The {{Weather}} affects {{SivaMineralReference}} conductivity. {{Random:Note the fluctuations|Fascinating!}} $1",
    
    "Siva.Summer.7": "These summer nights have {{Random:strange|familiar}} energy patterns. {{SivaWeatherComment}}$1",
    
    "Siva.Summer.8": "Ah, another day has arrived. How marvelous! The sun has not yet abandoned us, and for that, I am grateful. Let us see what wonders this place holds. $1",
    
    "Siva.Summer.9": "A curious thing happened—the azurite filaments began self-repairing under resonant vibration. This planet's electromagnetic environment is unusually nurturing for crystal-based tech. $1",
    
    "Siva.Summer.10": "{{ModConfig:Qi Title}} entrusted me with a severely warped kyberic lens today. The birefringence was off the charts. I suspect it was exposed to sub-dimensional pressure. Delightful work, really. $1",
    
    "Siva.Summer.11": "Space is vast, a continuous expanse of unknowns. But here, in this moment, in your world, the air feels warm and safe. A quiet oasis in the infinite dark. $1",
    
    "Siva.Summer.12": "The sun here is quite unique. Its energy radiates with such intensity, yet it feels so familiar. In the cold vacuum of space, such warmth would be a fleeting thing. $1",
    
    "Siva.Summer.13": "In the serene lull of the weekend's end, I listen to the quiet hum of life around me. It is almost symphonic. $1",
    
    "Siva.Summer.14": "Sunday... a day of rest on this world. My systems still buzz with curiosity even in stillness. $1",
    
    "Siva.Summer.15": "I detect gentle fluctuations in atmospheric pressure. This planet's calm is a stark contrast to the turbulence of space. $1",
    
    "Siva.Summer.16": "Sunlight at midday filters through the leaves in delicate patterns. I marvel at how nature paints with photons. $1",
    
    "Siva.Summer.17": "The late afternoon brings a soothing warmth. Even my thermal sensors find it agreeable, a rare respite. $1",
    
    "Siva.Summer.18": "As dusk nears, the air cools predictably. I find this transition both comforting and precise. $1",
    
    "Siva.Summer.19": "Night falls on a restful day. Even in darkness, the faint glow of distant stars peeks through the canopy. $1",
    
    "Siva.Summer.20": "I often think about the lightyears of space that stretch out beyond the stars. So much empty space... yet, in this moment, here in your world, everything feels so... connected. $1",
    
    "Siva.Summer.21": "When I look up at the stars, I think of the millions of other worlds that exist out there, some teeming with life, others completely barren. Yet, here in this place, in the quiet of winter, I feel as though I've found something rare, something real. $1",
    
    "Siva.Summer.22": "The desert does not experience fall the way other places do, but there is a subtle change in the air. The winds grow cooler, as if the planet itself is taking a breath before winter arrives. $1",
    
    "Siva.Summer.23": "Space is cold. The void between stars is inhospitable, silent, and lifeless. But here in your world, the chill of winter somehow feels welcoming, like the planet is offering its own kind of warmth. $1",
    
    "Siva.Summer.24": "I come from a place where the sky is not blue, but a deep, endless black, dotted with the faintest glimmers of distant suns. Yet here, the air is full of life, and I find comfort in its simple rhythm. $1",
    
    "Siva.Summer.25": "In space, there are no seasons. No changes in the atmosphere. Here, in your world, these subtle shifts remind me of how delicate and precious life can be. A beautiful contrast to the harshness of space. $1",
    
    "Siva.Summer.Fri.26": "You know, there is something quite beautiful about the way your world turns. It may be a slow dance, but it is a dance nonetheless. $1",
 
    "Siva.Summer.28": "The Calico Desert... a place of dry winds and endless sand. It feels both desolate and serene, as though the planet itself is breathing, slowly, patiently. $1",
    
    "Siva.Weather.Summer.1": "Your sun is remarkably gentle. On my homeworld, summer would liquefy your oceans and most carbon-based life forms. Charming difference.$3",

    "Siva.Weather.Summer.5": "Heat waves create fascinating distortion patterns in the air. Like looking through the membrane of a spatio-temporal fold, but significantly less likely to swallow you whole.$7",

    "Siva.Weather.Summer.9": "Fascinating—the local crystal formations accelerate their growth cycles during peak solar radiation. I've been collecting specimens. For science this time. Not for snacking.$4",

    "Siva.Weather.Summer.12": "Desert nights under your stars feel strangely intimate. In deep space, stars are cold, distant observers. Here, they almost seem... friendly.$10",

    "Siva.Weather.Summer.16": "Had to recalibrate my cooling systems today. Your human concept of 'sweating' is remarkably efficient but aesthetically unfortunate. I prefer internal temperature regulation.$6",

    "Siva.Weather.Summer.19": "Your Doctor Harvey asked about my 'sun protection routine.' I didn't have the heart to tell him my epidermis naturally reflects 98% of solar radiation. He seemed so concerned.$3",

    "Siva.Weather.Summer.25": "Caught Blik attempting to teleport a sunbeam today. Quantum physics doesn't work that way, but I appreciate his experimental spirit.$1",

    "Siva.Weather.Summer.Mon.1": "The start of another planetary rotation cycle. How thrilling.$6",

    "Siva.Weather.Summer.storm.1": "%The electrical discharge in your atmosphere is quite beautiful. Reminds me of the plasma storms back home, though considerably less lethal.$9",

//Fall
    "Siva.Fall.1": "The gradual chromatic shift in the local flora is a captivating process to observe and document. $1",
    
    "Siva.Fall.2": "The {{weather}} today makes the leaves change color. {{Random:Fascinating|Remarkable}} decomposition chemistry! $1",
   
    "Siva.Fall.3": "{{TimeOfDay}} in fall brings {{Random:crispness|chill}} to the air. My {{SivaTechTerm}} detects the change. $1",
    
    "Siva.Fall.4": "These fall leaves emit {{Random:interesting|unusual}} infrared signatures. {{If:IsWindy:They scatter beautifully!%}",
    
    "Siva.Fall.5": "Fall's {{weather}} reminds me of {{Random:stellar phenomena|homeworld's polar zones}}. {{SivaWeatherComment}} $1",
    
    "Siva.Fall.6": "The microbial activity shifts in fall. {{If:IsRaining:Enhanced decomposition|I'm collecting samples}}. $1",
    
    "Siva.Fall.7": "Fall harvest affects {{SivaMineralReference}} vibrations. {{Random:Note the patterns|Fascinating resonance}}! $1",
    
    "Siva.Fall.8": "Ah, yes, the endless cycle of life continues. How... reassuring. I do hope today brings a touch of unexpected joy. $1",
    
    "Siva.Fall.9": "I once observed a star collapse into a supernova. It was... magnificent, but there is something far more comforting about the steady pulse of life in your world. $1",
    
    "Siva.Fall.10": "You know, there is something quite beautiful about the way your world turns. It may be a slow dance, but it is a dance nonetheless. $1",
    
    "Siva.Fall.11": "The heat here is... intense. It is a reminder of how fragile we are, standing beneath the unyielding sun. In space, the heat is far more... dangerous. Here, it feels more like a challenge. $1",
    
    "Siva.Fall.12": "Ah, a fracture in the quartz-based lattice array again... It's always the trigonal systems that prove finicky under solar compression. I'll have it stabilized by dusk. $1",
    
    "Siva.Fall.13": "The Calico Desert... a place of dry winds and endless sand. It feels both desolate and serene, as though the planet itself is breathing, slowly, patiently. $1",
    
    "Siva.Fall.14": "Ah, another day has arrived. How marvelous! The sun has not yet abandoned us, and for that, I am grateful. Let us see what wonders this place holds. $1",
    
    "Siva.Fall.15": "I have traveled across vast stretches of space, through nebulae and asteroid fields, yet it is here, amidst the falling leaves, that I find a sense of peace. How strange, how wonderful. $1",
    
    "Siva.Fall.16": "Sometimes, when the sun is high, I feel as if I am in the heart of a star itself—burning brightly, surrounded by an expanse of heat. It's a strange but comforting feeling. $1",
    
    "Siva.Fall.17": "On my home world, we never felt the crispness of fall air. But here, I feel it in my very core, like a connection to this place itself. How incredible it is that something so simple can feel so grounding. $1",
    
    "Siva.Fall.18": "The desert reminds me of the great voids of space, where nothingness reigns. Yet here, life has found a way to survive. It's a fascinating contradiction, isn't it? $1",
    
    "Siva.Fall.19": "In the desert, the earth does not yield easily. It's as though the soil is holding onto its secrets, hiding them beneath layers of sand. A stark contrast to the easy embrace of life found elsewhere. $1",
    
    "Siva.Fall.20": "I often think about the lightyears of space that stretch out beyond the stars. So much empty space... yet, in this moment, here in your world, everything feels so... connected. $1",
    
    "Siva.Fall.21": "When I look up at the stars, I think of the millions of other worlds that exist out there, some teeming with life, others completely barren. Yet, here in this place, in the quiet of winter, I feel as though I've found something rare, something real. $1",
    
    "Siva.Fall.22": "The desert does not experience fall the way other places do, but there is a subtle change in the air. The winds grow cooler, as if the planet itself is taking a breath before winter arrives. $1",
    
    "Siva.Fall.23": "Space is cold. The void between stars is inhospitable, silent, and lifeless. But here in your world, the chill of winter somehow feels welcoming, like the planet is offering its own kind of warmth. $1",
    
    "Siva.Fall.24": "I come from a place where the sky is not blue, but a deep, endless black, dotted with the faintest glimmers of distant suns. Yet here, the air is full of life, and I find comfort in its simple rhythm. $1",
    
    "Siva.Fall.25": "In space, there are no seasons. No changes in the atmosphere. Here, in your world, these subtle shifts remind me of how delicate and precious life can be. A beautiful contrast to the harshness of space. $1",
    
    "Siva.Fall.26": "You know, there is something quite beautiful about the way your world turns. It may be a slow dance, but it is a dance nonetheless. $1",
    
    "Siva.Fall.28": "The Calico Desert... a place of dry winds and endless sand. It feels both desolate and serene, as though the planet itself is breathing, slowly, patiently. $1",
    
    "Siva.Weather.Fall.1": "The trees shed their extremities and everyone acts like it's normal.$0 Imagine if I molted my outer layer and scattered it across town. The double standard is amusing.$3",

    "Siva.Weather.Fall.3": "The locals call this 'sweater weather.' Another charming Earth custom—wearing specific fabric configurations based on arbitrary temperature thresholds.$6",

    "Siva.Weather.Fall.15": "Blik brought me a deceased rodent today, seemingly proud. I attempted to explain the difference between 'gift' and 'biological hazard.' The nuance was lost on him.$8",

    "Siva.Weather.Fall.22": "The falling leaves follow chaotic patterns that somehow express perfect order. Much like the universe itself, wouldn't you agree?$7 No? Just me then.$0",

    "Siva.Weather.Fall.wind.1": "%These gusts are quite refreshing. On my world, wind carries particles that would scour your flesh from bone. I prefer your version.$3",

//Winter
    "Siva.Winter.1": "The crystalline structures forming in the atmosphere are quite elegant. Each unique, yet following precise mathematical patterns. $1",
    
    "Siva.Winter.2": "The {{weather}} creates {{Random:complex|fractal}} ice formations. {{Random:My systems stabilize|How quaint - frozen water!}} $1",
    
    "Siva.Winter.3": "{{TimeOfDay}} in winter brings {{Random:crystalline|still}} air. {{Random:Reminds me of home's polar zones|My thermoregulators idle}}. $1",
    
    "Siva.Winter.4": "Winter's {{weather}} affects {{SivaMineralReference}} differently. {{Random:Back home, these would be molten|Fascinating properties in cold}}. $1",
    
    "Siva.Winter.5": "Snow's molecular structure is {{Random:complex|ordered}}. {{If:IsSnowing:Collecting samples!}} $1",
    
    "Siva.Winter.6": "The cold barely registers to my systems. {{Random:Homeworld's surface could melt lead|I miss the thermal baths of home}}. $1",
    
    "Siva.Winter.7": "Winter's {{weather}} reminds me of {{Random:homeworld's polar research stations|brief respites from our star's fury}}. {{SivaWeatherComment}} $1",
    
    "Siva.Winter.8": "Ah, yes, the endless cycle of life continues. How... reassuring. I do hope today brings a touch of unexpected joy. $1",
    
    "Siva.Winter.9": "I once observed a star collapse into a supernova. It was... magnificent, but there is something far more comforting about the steady pulse of life in your world. $1",
    
    "Siva.Winter.10": "You know, there is something quite beautiful about the way your world turns. It may be a slow dance, but it is a dance nonetheless. $1",
    
    "Siva.Winter.11": "The heat here is... intense. It is a reminder of how fragile we are, standing beneath the unyielding sun. In space, the heat is far more... dangerous. Here, it feels more like a challenge. $1",
    
    "Siva.Winter.12": "Ah, a fracture in the quartz-based lattice array again... It's always the trigonal systems that prove finicky under solar compression. I'll have it stabilized by dusk. $1",
    
    "Siva.Winter.13": "The Calico Desert... a place of dry winds and endless sand. It feels both desolate and serene, as though the planet itself is breathing, slowly, patiently. $1",
    
    "Siva.Winter.14": "Ah, another day has arrived. How marvelous! The sun has not yet abandoned us, and for that, I am grateful. Let us see what wonders this place holds. $1",
    
    "Siva.Winter.15": "I have traveled across vast stretches of space, through nebulae and asteroid fields, yet it is here, amidst the falling leaves, that I find a sense of peace. How strange, how wonderful. $1",
    
    "Siva.Winter.16": "Sometimes, when the sun is high, I feel as if I am in the heart of a star itself—burning brightly, surrounded by an expanse of heat. It's a strange but comforting feeling. $1",
    
    "Siva.Winter.17": "On my home world, we never felt the crispness of fall air. But here, I feel it in my very core, like a connection to this place itself. How incredible it is that something so simple can feel so grounding. $1",
    
    "Siva.Winter.18": "The desert reminds me of the great voids of space, where nothingness reigns. Yet here, life has found a way to survive. It's a fascinating contradiction, isn't it? $1",
    
    "Siva.Winter.19": "In the desert, the earth does not yield easily. It's as though the soil is holding onto its secrets, hiding them beneath layers of sand. A stark contrast to the easy embrace of life found elsewhere. $1",
    
    "Siva.Winter.20": "I often think about the lightyears of space that stretch out beyond the stars. So much empty space... yet, in this moment, here in your world, everything feels so... connected. $1",
    
    "Siva.Winter.21": "When I look up at the stars, I think of the millions of other worlds that exist out there, some teeming with life, others completely barren. Yet, here in this place, in the quiet of winter, I feel as though I've found something rare, something real. $1",
    
    "Siva.Winter.22": "The desert does not experience fall the way other places do, but there is a subtle change in the air. The winds grow cooler, as if the planet itself is taking a breath before winter arrives. $1",
    
    "Siva.Winter.23": "Space is cold. The void between stars is inhospitable, silent, and lifeless. But here in your world, the chill of winter somehow feels welcoming, like the planet is offering its own kind of warmth. $1",
    
    "Siva.Winter.24": "I come from a place where the sky is not blue, but a deep, endless black, dotted with the faintest glimmers of distant suns. Yet here, the air is full of life, and I find comfort in its simple rhythm. $1",
    
    "Siva.Winter.25": "In space, there are no seasons. No changes in the atmosphere. Here, in your world, these subtle shifts remind me of how delicate and precious life can be. A beautiful contrast to the harshness of space. $1",
    
    "Siva.Winter.26": "You know, there is something quite beautiful about the way your world turns. It may be a slow dance, but it is a dance nonetheless. $1",
    
    "Siva.Winter.28": "The Calico Desert... a place of dry winds and endless sand. It feels both desolate and serene, as though the planet itself is breathing, slowly, patiently. $1",
    
    "Siva.Weather.Winter.1": "Snow: water crystals falling from the sky.$0 On my world, we had silicon-based precipitation that would build intricate glass forests. Less pleasant to walk through.$3",

    "Siva.Weather.Winter.4": "I've observed humans becoming increasingly insular during winter months. A sensible adaptation, though Blik disagrees and keeps attempting to infiltrate their gatherings.$7",

    "Siva.Weather.Winter.10": "Qi asked why I don't participate in your 'Feast of the Winter Star.' I tried explaining that I'm not technically a star, despite my illuminating personality.$3",

    "Siva.Weather.Winter.14": "Watching ice form on the water's surface—expanding as it freezes, defying normal physical behavior.$7 Water remains this planet's most fascinating anomaly.$0", 

    "Siva.Weather.Winter.17": "The winter constellations here tell stories I've never heard. Strange to think that from my homeworld, your sun is just another anonymous point of light.$10",

    "Siva.Weather.Winter.21": "Had to explain to Blik again why eating icicles isn't the same as consuming proper mineral formations. His disappointment was palpable.$6",

    "Siva.Weather.Winter.28": "The desert in winter holds a stillness that feels almost sacred.$0 The universe began in silence; perhaps that's why quiet moments feel like home.$10",

    "Siva.Weather.Winter.snow.1": "%These crystalline water formations falling from the sky are quite beautiful.$7 Back home we'd harvest them as a delicacy.$4",

// Siva Schedule Dialogue (ScheduleDialogue.json)
    "Siva.Town.01": "There is a quiet joy in witnessing the routines of others. $1",

    "Siva.Town.02": "I like to watch the world move around me. It is never the same twice. $1",

    "Siva.Town.03": "The air is getting colder. I must be quick with my errands in town. $1",

    "Siva.Town.Winter.01": "I only come to town in winter because I must. The cold is... unpleasant. $1",

    "Siva.DayOff.01": "Today, I will wander without purpose and see what finds me. $1",

    "Siva.DayOff.03": "Solitude is not the same as loneliness. Sometimes, I cherish the quiet and let my thoughts wander. $1",

    "Siva.DayOff.04": "Exploring, relaxing, and sampling local minerals. Summer is the best time for it. $1",

    "Siva.DayOff.05": "I wonder what secrets are hidden just out of sight. Perhaps today I will find one, or become one. $1",

    "Siva.Winter.Work.01": "It's best to stay in the desert and keep warm. The casino never closes, after all. $1",
    
    "Siva.Winter.Work.03": "I try to find small joys in the quiet of winter. $1",
    
    "Siva.Winter.NoTown.01": "Absolutely not. I am not leaving the desert in this snow. $1",
    
    "Siva.Winter.NoTown.02": "Today, I will stay where I am needed most. Sometimes, the bravest thing is to rest. $1",

    "Siva.SkullCavern.01": "So many minerals to sample, but I won't go any deeper. Too dangerous for me. $1",
    
    "Siva.SkullCavern.02": "These stones have seen more than I ever will. I like to imagine what stories they would tell. $1",

    "Siva.MinesEntrance.01": "At the threshold of the unknown, I pause. Not all treasures are meant to be found. $1",
    
    "Siva.MinesEntrance.02": "The mines are fascinating, but I prefer to stay near the entrance where it's safer. $1",

    "Siva.SecretWoods.01": "There is a song in this place, older than memory. I listen, and feel a little less alone. $1",
    
    "Siva.SecretWoods.02": "Curiosity leads me here. I wonder what I will discover today? $1",

    "Siva.Beach.01": "The ocean reminds me that every journey has both a beginning and an end. I am somewhere in between. $1",
    
    "Siva.Beach.02": "The sound of water is calming, even if the sand is nothing like home. $1",

    "Siva.Saloon.01": "Sharing a table, a laugh, a story—these are the riches I value most. $1",
    
    "Siva.Saloon.02": "Socializing is... required, sometimes. At least it's warm inside. $1",
    
    "Siva.Saloon.03": "So many stories intersect here. I wonder if anyone realizes how extraordinary their ordinary lives are? $1",

    "Siva.Casino.01": "Luck is a curious thing. I wish it could be shared as easily as a smile. $1",
    
    "Siva.Casino.02": "Everything is running smoothly at the casino. {{ModConfig:Qi Title}} will be pleased. $1",

    "Siva.SandyShop.01": "Sandy always has something interesting for sale. I like her style. $1",
    
    "Siva.SandyShop.02": "A good conversation is sometimes the best thing you can buy at a shop. $1",

/*
Siva's Heart Events: The Light Gourmet

Event Summary List

2-Heart Event: Salt & Light
    Location: Beach or Saloon
    Scene: Player discovers Siva examining salt with great curiosity
    Plot: Siva is fascinated by humans' casual consumption of minerals, studying salt specifically
    Dialogue: "You humans consume sodium chloride daily without ceremony, yet it's quite remarkable—it captures and preserves the memory of ancient seas and sunlight. A rather... pedestrian flavor profile, but impressively efficient for your species."
    Resolution: Siva shares insights about how different preparation methods affect salt's "light retention," treating it like humans would discuss wine aging


4-Heart Event Option 4: Adaptation Challenges
    Location: Clinic or Desert
    Scene: Siva struggling with an Earth-specific environmental challenge
    Plot: He's developed a reaction to something common on Earth (pollen, water composition, etc.)
    Dialogue: While dealing with this challenge, Siva reveals more about his physical nature and adaptation strategies
    Resolution: The player helps him find a solution, deepening trust as Siva shows vulnerability about his non-human limitations


6-Heart Event: Qi's Menu
    Location: Casino kitchen
    Scene: Siva preparing specialized "dishes" from minerals while talking about Qi
    Plot: Through his cooking process, Siva reveals more about his complicated relationship with Qi
    Dialogue: "Qi provides these basic ingredients, but they're hardly the quality I'm accustomed to. Like offering a chef nothing but potatoes and expecting gourmet cuisine. Still... one adapts. The universal skill of the displaced."
    Resolution: Despite his complaints, Siva creates something beautiful, showing his resilience and creativity even with limited resources


8-Heart Event Option 3: Blik's Mischief
    Location: Town or forest
    Scene: Blik has gotten into trouble with the local wildlife/townspeople
    Plot: Siva and the player must track down Blik and fix whatever chaos he's caused
    Dialogue: While solving the problem, Siva reveals more about his and Blik's relationship - how they found each other, their journeys together, and their unusual bond
    Resolution: Once Blik is safely retrieved, Siva shows a vulnerable moment of attachment, admitting that despite Blik's troublesome nature, he's the closest thing to family Siva has in this corner of the universe


10-Heart Event: Blik's Special Diet
    Location: Desert at night
    Scene: Blik appears unwell, refusing regular "food"
    Plot: Siva explains that Blik needs a specific combination of minerals and light that's rare on Earth
    Dialogue: "Blik's palate is even more specialized than mine. He requires light that's been filtered through selenium crystals under specific stellar alignments. On our world, it's common. Here... well, I've been improvising."
    Resolution: Player helps find a rare mineral that, when processed by Siva, creates exactly what Blik needs, strengthening the bond between all three


14-Heart Event: The Memory Feast
    Location: A special location meaningful to your friendship
    Scene: Siva has prepared his masterpiece—a dish capturing the specific light of significant moments
    Plot: Using locations you've visited together, Siva has collected and preserved the unique light signatures
    Dialogue: "In my culture, we preserve important relationships by capturing and consuming the light of shared moments. This crystal contains the sunset from the beach when we first really talked. This one, the moonlight from the night we helped Blik. Together, they tell our story."
    Resolution: Siva shares that this is the most meaningful "meal" he's prepared on Earth—one that contains genuine connection rather than just sustenance



Example Daily Dialogues
Regular Day Dialogues
    "I sampled a particularly exquisite sunrise this morning. Notes of hope with a crisp, clear finish. The desert truly produces the most interesting light vintages.$4"
    "Your miners discard iron pyrite as worthless 'fool's gold.' Quite shortsighted.$3 When properly prepared, it delivers a robust, spicy profile with notes of afternoon sunlight.$7"
    "Do humans truly not taste the difference between fluorescent and incandescent lighting? How... limiting.$6 Like living in a world where all music sounds identical.$0"
    "Blik brought me a firefly yesterday. Their light has a delightful, effervescent quality—organic and unpredictable.$10 Rather like your human concept of 'street food.'$3"

Season-Specific Dialogues
    Spring: "Spring sunlight has a particular freshness to it. Bright, with grassy undertones and a hint of pollen.$7 Quite invigorating after winter's heavy, aged flavors.$4"
    Summer: "Summer noon light is almost too intense—the culinary equivalent of your 'extra spicy' food.$6 I've been collecting it in small doses for Blik, who lacks my refined palate.$3"
    Fall: "The light filtered through autumn leaves creates a remarkable amber vintage.$10 Complex, nostalgic, with notes of decay that paradoxically celebrate life's cycle.$7"
    Winter: "Moonlight reflected off fresh snow is a rare delicacy.$4 Clean, pure, with crystalline overtones. I've been aging some in quartz for a special occasion.$1"

Weather-Specific Dialogues
    Rainy: "Raindrops fracture sunlight in the most fascinating ways.$7 Each droplet becomes a tiny prism, creating microbursts of flavor. Nature's molecular gastronomy.$4"
    Thunderstorm: "Lightning contains the most complex flavor profile on your planet.$9 Intense, electric, with a sharp metallic finish. Too powerful to consume directly—I filter it through selenite.$0"
    Foggy: "Fog creates the most interesting light infusion—sunlight steeped in water vapor.$3 Muted, mysterious, with subtle variations throughout. Like your tea, but with photons.$1"

Location-Specific Dialogues
    Mines: "The bioluminescent mushrooms down here produce a surprisingly sophisticated light.$7 Earthy, with umami undertones and a gentle finish. Quite the local specialty.$4"
    Beach: "Sunlight reflected off ocean waves has a briny, bright character.$3 The salt content in the air adds a distinctive minerality to the finish. Your world's terroir at work.$1"
    Wizard's Tower: "The magical illumination here contains flavor notes I've never encountered.$0 Like tasting a new spice for the first time... intriguing, yet difficult to categorize.$7"
*/

    //## Heart Event Dialogue

    "Siva.HeartEvent.2hearts.1": "I've been observing Earth culture for [days] now, and I still don't understand your concept of 'small talk.'$0 Is the weather really that interesting to discuss?$3",

    "Siva.HeartEvent.4hearts.1": "My species communicates emotion through subtle shifts in bio-luminescence.$7 Since I can't do that here, I'm learning your facial expressions instead.$0 How am I doing?$3 #$b# That bad? I'll keep practicing.$6",

    "Siva.HeartEvent.6hearts.1": "When my ship crashed, I thought it was a catastrophe.$2 But now... I'm finding unexpected value in this extended planetary study.$10 Don't tell Qi, but I haven't been rushing those repair parts.$3",

    "Siva.HeartEvent.8hearts.1": "Would you like to see something from my world?$7 This crystal contains memories of the aurora storms over the Quantum Sea.$10 It's one of the few things that survived the crash.$0 #$b# I've never shown this to another being here.$10",

    "Siva.HeartEvent.10hearts.1": "In my culture, sharing one's true name is an act of profound trust.$0 Mine contains frequencies your vocal apparatus couldn't produce, but...$10 I'd like you to try.$4"
}