{
    /*
    
    https://stardewvalleywiki.com/Modding:Dialogue
    
    https://github.com/Pathoschild/StardewMods/blob/develop/ContentPatcher/docs/author-guide/tokens.md
    
    "$c 0.5#first dialogue#second dialogue" is the randomized way built into vanilla. 
    "{{I18n:dialogue.npc.{{random:1,2,3}} }}" with keys for dialogue.npc.1, dialogue.npc.2 etc in the i18n default folder is how you can do it in i18n very easily.
    
    */
    
    //Config//
        "Config.Unwipeable.name": "Unwipeable",
            
        "Config.Unwipeable.description": "Default true to have Siva's memory be unwipeable from the witch statue.",
    
        "Config.Qi Title.name": "Qi Title",
    
        "Config.Qi Title.description": "Sets the title for Qi.",
    
    //Music//
        "Siva.Music.Workshop": "Shimmering Nebulae (void1gaming)",
    
        "Siva.Music.Date": "Carnival Date (JStewartMusic)",
    
    //Gifts//
        "Siva.BirthdayGift.Love.1": "...$1",
    
        "Siva.BirthdayGift.Like.1": "...$1",

        "Siva.BirthdayGift.Neutral.1": "...$1",
    
        "Siva.BirthdayGift.Dislike.1": "...$1",

        "Siva.BirthdayGift.Hate.1": "...$1",
    
        "Siva.Gift.Love.1": "Oh! This is most excellent.$4 I shall treasure this—and perhaps conduct a small assessment later.$1 My sincere gratitude. You have brightened my entire day.$4",
    
        "Siva.Gift.Love.2": "You could not have selected anything more perfect!$4 It is as though you have read my thoughts.$1 This has significantly improved today's prospects.$4",
    
        "Siva.Gift.Love.3": "This is... precisely what I required today.$4 How did you know? You possess a most discerning eye for quality.$1 I am genuinely touched.$4",
    
        "Siva.Gift.Like.1": "Ah, a fine selection.$7 Not my typical preference, but I find it increasingly appealing.$3 My thanks.$1",
    
        "Siva.Gift.Like.2": "How thoughtful of you.$7 The residents of this region continue to surprise me in pleasant ways.$3 I appreciate your consideration.$1",
    
        "Siva.Gift.Like.3": "This shall integrate perfectly into my collection.$7 I notice when individuals pay attention to my preferences.$3 You have my sincere gratitude.$1",
    
        "Siva.Gift.Neutral.1": "Oh, you have brought me something.$0 That is... considerate of you. Thank you for your thoughtfulness.$3",
    
        "Siva.Gift.Neutral.2": "A gift. For me.$0 How... considerate.$3 You have my thanks, I suppose.$1",
    
        "Siva.Gift.Neutral.3": "I observe you have brought me a gift.$0 I am still adapting to local customs.$3 Thank you for including me in your traditions.$1",
    
        "Siva.Gift.Dislike.1": "I... understand your good intentions.$6 Our tastes appear to differ rather significantly, but your consideration is appreciated.$3 Thank you for thinking of me regardless.$1",
    
        "Siva.Gift.Dislike.2": "Oh.$6 That is... interesting.$3 Not precisely to my taste, but I appreciate your effort nonetheless.$1",
    
        "Siva.Gift.Dislike.3": "How kind of you to bring me something.$6 Not quite suited to my preferences, but the gesture is appreciated.$3 Thank you all the same.$1",
    
        "Siva.Gift.Hate.1": "Oh.$8 Um... thank you for the gesture?$5 Perhaps next time we might discuss my actual preferences?$3",
    
        "Siva.Gift.Hate.2": "I can see you were attempting to be kind.$8 But this is... rather unfortunate.$5 Perhaps I could demonstrate my preferences sometime.$3",
    
        "Siva.Gift.Hate.3": "I understand your intentions were positive,$8 but this item and I are fundamentally incompatible.$5 The sentiment is appreciated, even if the gift is not.$3",
    
        "Siva.Gift.CrystalFruit.1": "Crystal fruit! My absolute favorite delicacy!$4 How did you discern this is precisely what I adore?$1 You are remarkably observant, are you not?$4",
    
        "Siva.Gift.Gem.1": "My word, what a magnificent gem!$4 You truly understand what brings me joy.$1 This illuminates my entire day.$4",
    
        "Siva.Gift.Mineral.1": "Ah! This reminds me of my homeland.$7 The minerals in this region possess their own unique character.$3 A most thoughtful selection.$1",
    
        "Siva.Gift.Mineral.2": "I truly adore this type of gift.$7 It aligns perfectly with my tastes.$3 Your attentiveness is most appreciated.$1",
    
    // General CTs
        "Siva.Dialogue.Introduction": "I am called Siva. I have only recently established myself in this locale.$3 Mr. Qi has employed me as his personal chef while my... transportation arrangements are being resolved.$1",
    
        "Siva.Dialogue.Resort_Entering.1": "A beach resort! How delightful.$7 I feel I should mention - my skin has an unusual reaction to chlorine. Nothing of concern, but it may impart an interesting hue to the water.$3",
    
        "Siva.Dialogue.Resort_Shore.1": "I shall observe from this position, if you do not mind.$0 Large bodies of water and myself maintain something of a mutual disagreement.$8",
    
        "Siva.Dialogue.Movie_Invitation.1": "A cinematic experience? How intriguing.$7 In my homeland, we had rather different forms of entertainment. The cultural variation is fascinating.$4 I would be most pleased to discover what makes these 'movies' so appealing.$1",
    
        "Siva.Dialogue.cc_Complete.1": "You have restored the community center to functionality!$0 It is remarkable how a proper gathering space unites individuals.$7 Perhaps this town possesses more wisdom than I initially credited it with.$10",
    
        "Siva.Dialogue.danceAccept.1": "You wish to dance together? I must confess I lack natural grace, but I am willing to attempt it.$7 I request your patience should I inadvertently tread upon your feet.$3",
        
        "Siva.Dialogue.danceRejection.1": "I am grateful for your dance invitation,$6 but I possess what you might call 'two left feet' - more literally than you might imagine.$3 Perhaps after I have practiced? I am still adjusting to... shall we say, local footwear.$1",
    
        "Siva.Dialogue.GreenRain.1": "The precipitation today exhibits an unusual verdant hue.$7 It reminds me of a rare atmospheric condition from my homeland. Most curious to observe it here.$3",
    
        "Siva.Dialogue.GreenRainFinished.1": "The emerald rainfall has finally ceased.$0 I collected a sample for culinary examination—it possesses a fascinating mineral flavor profile. Rather evocative of my childhood, actually.$3",
    
        "Siva.Dialogue.GreenRain_2.1": "This green rain is really hanging around.$7 Have you seen how the plants are loving it? This valley keeps surprising me.$4",
    
        "Siva.Dialogue.Resort_Leaving.1": "I've had enough sun for one day.$7 My skin gets weird if I stay out too long. See you around.$3",
    
        "Siva.Dialogue.Resort_Chair.1": "I am attempting to comprehend this concept of 'relaxation.'$0 In my homeland, leisure time was quite scarce. This experience is... more pleasant than anticipated.$3",
    
        "Siva.Dialogue.Resort_Bar.1": "These beverages have minimal effect on my physiology.$0 However, I greatly appreciate the social ritual of communal drinking.$10 I shall have another, if you please!$4",
    
        "Siva.Dialogue.Resort.1": "Swimming as a recreational pursuit?$3 A fascinating concept - I am endeavoring to comprehend its appeal.$7 From the safety of dry land, naturally.$0",
    
        "Siva.Dialogue.Resort_Towel.1": "I am reposing upon this fabric rectangle as is customary.$7 The coastal areas of my homeland were rather different - the mineral composition of our sand emitted a gentle luminescence after sunset.$3",
    
        "Siva.Dialogue.Resort_Umbrella.1": "I find it rather amusing how humans visit the beach for sunlight yet conceal themselves beneath parasols.$0 Perhaps not everyone appreciates solar radiation.$3 My epidermis actually benefits from sun exposure - it develops a most pleasant iridescence.$7",
    
        "Siva.Dialogue.Resort_Wander.1": "I am simply perambulating, observing the recreational activities of others.$7 Human behavior patterns shift notably in this coastal environment compared to the town center.$0 There appears to be increased relaxation and spontaneity.$3",
    
        "Siva.Dialogue.cc_Begin.1": "You're fixing up the community center?$7 That's awesome. We did things differently where I grew up, but I love seeing people work together like this.$3",
    
        "Siva.Dialogue.cc_Boulder.1": "Just a big rock in the way.$0 My grandmother had an old technique for moving heavy things—something about proper vibrations. Your dynamite's probably faster though.$3",
    
        "Siva.Dialogue.cc_Bridge.1": "Nice bridge work! Connects everything together.$7 Simple but it works perfectly. Sometimes the best solutions aren't complicated ones.$10",
    
        "Siva.Dialogue.cc_Bus.1": "Got the bus running again, huh?$0 Reminds me of stories my grandparents told about their old village transportation. Nostalgia, you know?$3",
    
        "Siva.Dialogue.cc_Greenhouse.1": "Nice greenhouse you've got now!$7 We had something similar back home, though ours was for growing... different kinds of plants. Still, same basic idea.$4",
    
        "Siva.Dialogue.movieTheater.1": "So this is your movie theater!$7 We had something like it where I grew up, but the experience was a bit different. I'm curious to see how yours works.$3",
    
        "Siva.Dialogue.luauBest.1": "That potluck was actually pretty great!$4 I have some dietary restrictions, but I could still appreciate how good everything was. Your contribution really made the difference.$1",
    
        "Siva.Dialogue.luauShorts.1": "Did someone just put underwear in the soup?$8 Is that some weird tradition nobody told me about?$5 Judging by the Governor's face, I'm guessing not.$6",
    
        "Siva.Dialogue.luauPoisoned.1": "That soup made everyone sick!$8 Even my iron stomach couldn't handle whatever was in there.$5 I've got some special digestive remedies I could share next time.$3",

    // Community Center CTs
        "Siva.Dialogue.cc_Begin": "Those little forest sprites got you helping them?$7 That's pretty cool.$0 Maybe folks around here are more open-minded than I thought.$3",

        "Siva.Dialogue.cc_Complete": "You got the community center all fixed up!$0 It's amazing how a good meeting place brings people together.$7 This town might be onto something after all.$10",

        "Siva.Dialogue.cc_Boulder": "You got rid of that big boulder? Nice work.$0 Where I come from, we'd have found a way around it instead.$3 But your direct approach has a certain charm.$1",

        "Siva.Dialogue.cc_Bridge": "The quarry bridge is working again? Fantastic!$4 The minerals around here are really interesting.$7 I might need to do some... taste testing over there. For cooking inspiration, of course.$3",

        "Siva.Dialogue.cc_Bus": "Got the old bus running again, huh?$0 Not the most efficient ride, but it gets the job done.$3 Must feel good seeing it up and running?$7",

        "Siva.Dialogue.cc_Greenhouse": "Your greenhouse is up and running!$4 Simple design, but it works perfectly.$7 I've been thinking about growing some special ingredients in there...$10 With your permission, of course.$3",

        "Siva.Dialogue.cc_Minecart": "The minecart system's working again?$0 We didn't have anything like that where I grew up.$10 There's something fun about it - I might take a ride.$7",

    // JojaMart Path CTs
        "Siva.Dialogue.joja_Begin": "So you're siding with the big blue corporate guys?$5 Interesting choice.$0 Big companies tend to work the same way everywhere, I guess.$6 Not judging, just saying.$3",

    // Movie Theater CTs
        "Siva.Dialogue.movieTheater": "So this is a movie theater!$7 We told stories differently where I grew up, but I'm excited to try this out.$4",

    // Pet Event CTs
        "Siva.Dialogue.gotPet": "You got yourself a pet? That's nice.$0 Blik's a bit jealous, but I think it's sweet how you two get along.$10 People and animals just naturally connect, don't they?$7",

    // Relationship Event CTs
        "Siva.Dialogue.dating": "You're dating someone now?$7 Where I come from, courtship involves more elaborate gifts and less awkward small talk.$3 Hope it works out for you two!$10",

        "Siva.Dialogue.married": "Congratulations on getting married!$4 That's a huge milestone.$0 Back home, people review their relationships every few years to see if they still work.$3 Your 'forever' idea is scary but kind of beautiful.$10",

        "Siva.Dialogue.married_twice": "A second marriage? That shows resilience.$7 Where I'm from, we say each relationship teaches us something different about ourselves.$10 What have you learned from your experiences?$0",

        "Siva.Dialogue.divorced_once": "Divorce is tough, I can see it's been hard on you.$5 Where I grew up, we saw relationships as chapters in our lives, not the whole story.$0 You haven't lost everything - you've just changed direction.$10",

    // Pam's House CT
        "Siva.Dialogue.pamHouseUpgrade": "Building Pam a house was incredibly generous of you.$4 Most people wouldn't go out of their way like that.$0 It's... actually really touching.$10",

        "Siva.Dialogue.pamHouseUpgradeAnonymous": "You built Pam a house and didn't take credit?$7 That's something special.$0 Maybe people really are naturally kind.$10 I'm impressed.$4",

    // Festival Event CTs
        "Siva.Dialogue.wonEggHunt": "You found the most eggs, huh?$4 Nice job! You've got sharp eyes and quick feet.$7 Still don't get why hiding eggs is fun, but hey, to each their own.$3",

        "Siva.Dialogue.wonGrange": "Your display won the fair? Nice!$4 Not surprising.$7 Your produce always looks perfect - great color, perfect texture.$3 In other words, good job!$10",

        "Siva.Dialogue.wonIceFishing": "You're pretty good at fishing through ice!$4 Where I grew up, lakes would get so hot they'd sometimes evaporate completely.$6 Harder to catch fish that way.$3",

    // Other Event CTs
        "Siva.Dialogue.FullCrabPond": "Your crab pond is totally full now!$0 It's kind of hypnotic watching them move around.$7 Where I grew up, we had crabs the size of your farmhouse.$4 Some people even kept them as pets.$3",

    // Willy's Event CT
        "Siva.Dialogue.willyCrabs": "Willy's crab problem was pretty funny.$3 My grandmother had this weird knack for dealing with crabs.$7 Have you tried just talking to them nicely?$0 No? Worth a shot.$3",

    // Spouse Events
        "Siva.Dialogue.elliottGone": "Elliott's away for a while?$0 It's interesting how relationships work through separation.$7 Where I'm from, couples are practically inseparable - sometimes unhealthily so.$3",

        "Siva.Dialogue.ElliottGone1": "Got a letter from Elliott?$7 Old-fashioned but sweet.$0 Though I bet I could rig up something for better long-distance chats if you wanted.$4",

        "Siva.Dialogue.ElliottGone2": "Another letter from Elliott?$3 It's sweet how much those handwritten words mean to you.$10", 

        "Siva.Dialogue.ElliottGone3": "Another letter?$0 I've noticed how his writing style changes with his mood.$7 You can really tell how he's feeling from the words he chooses.$3 Pretty effective for just pen and paper.$4",

        "Siva.Dialogue.ElliottGone4": "He writes to you pretty often, huh?$10 There's something really nice about your relationship.$7 Simple but meaningful.$4",

        "Siva.Dialogue.ElliottGone5": "You're practically glowing with excitement about seeing him soon!$4 It's strange how being apart can make people feel closer sometimes.$10 Doesn't make logical sense, but it's beautiful.$7",

        "Siva.Dialogue.ElliottGone6": "Last letter before he comes home?$4 People get pretty excited about reunions, don't they?$3 Mind if I see how you two greet each other? Just curious, that's all.$0",

        "Siva.Dialogue.ElliottGone7": "Today's the big day!$4 I made you a little something to celebrate.$10 Where I come from, friends always bring gifts when couples reunite after being apart.$7",

        "Siva.Dialogue.emilyFiber": "Collecting fibers for Emily's projects?$0 Supporting your partner's passions is always good.$10 We did similar things back home, though with very different materials.$7",

        "Siva.Dialogue.haleyCakewalk1": "Haley's event really got everyone excited!$0 People everywhere love a good party, don't they?$10 Some things are just universal.$7",

        "Siva.Dialogue.haleyCakewalk2": "The town still has this happy buzz after Haley's event.$7 Your partner really knows how to bring people together.$10 That's something special.$4",

        "Siva.Dialogue.leahPaint": "Leah's working on new paintings?$7 Where I grew up, art was very different - more about light and shadows.$3 But it's all about showing people how you see the world, isn't it?$10",

        "Siva.Dialogue.pennyRedecorating": "Penny's redecorating, huh?$0 Changing your space can really change your mood.$7 Blik 'redecorates' my stuff all the time.$6 Though it's less about style and more about chaos.$3",

        "Siva.Dialogue.samJob1": "Sam got a job? That's great!$4 Having steady work is a big step toward independence.$0 Good for him.$7",

        "Siva.Dialogue.samJob2": "Going from school to working life is a big change.$7 Sam seems to be handling it pretty well.$0 Hope he's enjoying the new job!$4",

        "Siva.Dialogue.samJob3": "It's not easy staying connected when someone's going through big life changes.$0 You're really supportive of Sam, and that says a lot about you.$10 It's nice to see.$7",

        "Siva.Dialogue.sebastianFrog": "Sebastian's frog hobby is pretty cool!$7 Blik tried to make friends with a frog yesterday.$3 Let's just say frogs can jump really high when scared.$6",

        "Siva.Dialogue.sebastianFrog2": "Sebastian really loves that frog, doesn't he?$10 People bond with all kinds of animals.$7 All special in their own way.$4",

        "Siva.Dialogue.shaneSaloon1": "Shane's new business at the saloon?$0 Going from customer to owner is a big change.$7 People find all sorts of ways to reinvent themselves around here.$3",

        "Siva.Dialogue.shaneSaloon2": "Everyone seems to like Shane's new business!$7 People appreciate someone who takes initiative.$10 He's really found his place here.$4",

    // Ten-Heart Group Events
        "Siva.Dialogue.dumped_Guys": "Wow, that was... a lot of drama.$5 Dating seems so complicated here.$0 Where I come from, people are more upfront about what they want.$3 Less exciting, but fewer angry mobs.$6",

        "Siva.Dialogue.dumped_Girls": "Yikes. Breaking up with everyone at once.$6 That looked... rough.$5 Don't worry too much though - most people don't find the right match on the first try.$0",

        "Siva.Dialogue.secondChance_Guys": "They forgave you? That's surprising!$4 Second chances don't come easy anywhere.$10 I'm... happy to see everyone making up.$7",

        "Siva.Dialogue.secondChance_Girls": "Talking it out really worked, huh?$7 Sometimes the simplest approach is best.$0 Being honest can fix a lot of problems.$10 As Qi would say, 'the truth has its own luck.'$4",

    // Luau Events
        "Siva.Dialogue.luauBest": "That potluck soup was amazing!$4 Everyone contributed something and it turned out perfect.$10 Kind of like the town itself, don't you think?$7",

        "Siva.Dialogue.luauShorts": "Someone put UNDERWEAR in the soup?$6 Is this some weird power move I don't know about?$5 Or just a terrible mistake?$0 Either way, the Governor's face was priceless.$3",

        "Siva.Dialogue.luauPoisoned": "Everyone got sick from the soup!$6 What a disaster.$0 Maybe next time we should have someone taste-test it first.$3 Just a thought for next year.$7",

    // Resort Events
        "Siva.Dialogue.Resort_Entering": "A beach resort! How delightful.$7 I feel I should mention - my skin has an unusual reaction to chlorine. Nothing of concern, but it may impart an interesting hue to the water.$3",

        "Siva.Dialogue.Resort_Leaving": "That was... interesting.$0 Though keeping Blik from diving under other swimmers was exhausting.$6 He thinks scaring people is a game.$3",

        "Siva.Dialogue.Resort_Chair": "I am attempting to comprehend this concept of 'relaxation.'$0 In my homeland, leisure time was quite scarce. This experience is... more pleasant than anticipated.$3",

        "Siva.Dialogue.Resort_Bar": "These beverages have minimal effect on my physiology.$0 However, I greatly appreciate the social ritual of communal drinking.$10 I shall have another, if you please!$4",

        "Siva.Dialogue.Resort": "Swimming as a recreational pursuit?$3 A fascinating concept - I am endeavoring to comprehend its appeal.$7 From the safety of dry land, naturally.$0",

        "Siva.Dialogue.Resort_Shore": "I shall observe from this position, if you do not mind.$0 Large bodies of water and myself maintain something of a mutual disagreement.$8",

        "Siva.Dialogue.Resort_Towel": "I am reposing upon this fabric rectangle as is customary.$7 The coastal areas of my homeland were rather different - the mineral composition of our sand emitted a gentle luminescence after sunset.$3",

        "Siva.Dialogue.Resort_Umbrella": "I find it rather amusing how humans visit the beach for sunlight yet conceal themselves beneath parasols.$0 Perhaps not everyone appreciates solar radiation.$3 My epidermis actually benefits from sun exposure - it develops a most pleasant iridescence.$7",

        "Siva.Dialogue.Resort_Wander": "I am simply perambulating, observing the recreational activities of others.$7 Human behavior patterns shift notably in this coastal environment compared to the town center.$0 There appears to be increased relaxation and spontaneity.$3",

    // Dance Events
        "Siva.Dialogue.danceAccept": "You wish to dance together? I must confess I lack natural grace, but I am willing to attempt it.$7 I request your patience should I inadvertently tread upon your feet.$3",

        "Siva.Dialogue.danceRejection": "I am grateful for your dance invitation,$6 but I possess what you might call 'two left feet' - more literally than you might imagine.$3 Perhaps after I have practiced? I am still adjusting to... shall we say, local footwear.$1",
    
    
    //Blik Dialogue
        "Blik.Damage.01": "Blik transformed my meticulously curated recipe collection into precise confetti strips this morning.$6 Six hours of culinary documentation ruined within minutes, yet I find myself unable to maintain displeasure when faced with his self-satisfaction.$4",
    
        "Blik.Exploration.01": "I observed Blik deliberately displacing merchandise from Pierre's shelving units today.$7 He maintained direct ocular contact with Pierre throughout the entire process. Pierre was understandably irate, while I found myself unable to suppress my amusement.$3",
    
        "Blik.Play.01": "Blik pursued a lepidopteran specimen through my meticulously organized flavor enhancement ingredients.$6 The resulting disarray was substantial, yet his evident joy provided adequate compensation.$4",
    
        "Blik.Desert.01": "Blik excavated approximately fifty percent of Sandy's succulent botanical display.$8 The restoration required substantial time and effort while he observed with an expression of unmistakable self-satisfaction.$3",
    
        "Blik.Villager.01": "Blik upended Emily's textile fiber repository and became thoroughly ensnared.$6 Upon liberating him from his predicament, his demeanor suggested we were the source of the difficulty. Most characteristic behavior.$3",
    
        "Blik.Curiosity.01": "Blik 'explored' the community center by climbing everything, swinging from lights, and knocking over a bookshelf.$6 His curiosity is matched only by his talent for chaos.$4",
    
        "Blik.Damage.02": "Blik knocked over my ingredient sorting table.$8 Everything I'd spent days organizing went everywhere, and there he sat in the middle, purring.$4 Can't even be mad at him.$1",
    
        "Blik.Play.02": "Found Blik playing with a rare desert herb I was saving.$6 It was expensive and hard to find. Now it's expensive, hard to find, and covered in teeth marks.$3",
    
        "Blik.Desert.02": "Blik brought me a 'present' from the desert. Half a living sandfish.$7 No idea how he caught it without getting hurt. The sandfish wasn't so lucky.$3",
    
        "Blik.Villager.02": "Blik knocked over Evelyn's fresh-baked cookies.$8 Then ate one while staring right at her.$6 She still called him 'precious' - his charm is somehow unstoppable.$3",
    
        "Blik.Curiosity.02": "Blik scratched a perfect spiral into the Wizard's door.$6 Weirdly, the Wizard was impressed by the pattern. Not so much by the damage.$3",
    
        "Blik.Desert.03": "Blik 'helped' me gather desert ingredients by burying my bag.$8 Spent hours digging it up while he took a nap in the shade.$3",
    
        "Blik.Damage.03": "Blik knocked my phone into my water glass.$8 Third time this month. Pretty sure he's doing it on purpose now.$6",
    
        "Blik.Exploration.02": "Blik attacked Willy's fishing line until it was completely tangled.$7 Willy gave up fishing, which Blik clearly saw as a win.$3",
    
        "Blik.Mischief.01": "Blik knocked Mayor Lewis's hat into the river.$6 Then pretended nothing happened. The perfect crime.$4",
    
        "Blik.Mischief.02": "Blik mixed up all of Pierre's seed packets.$7 I didn't catch him until he'd completely scrambled everything. Farmers might get some weird surprises this season.$3",
    
        "Blik.Mischief.03": "Blik broke into Marnie's feed storage and made a complete mess.$8 Took three people hours to clean while he watched from a high shelf, looking smug.$3",
    
        "Blik.Affection.01": "Blik destroyed my favorite pillow, then brought me the stuffing as a present.$6 Looked so proud I couldn't even be mad.$10",
    
        "Blik.Affection.02": "Blik keeps leaving dead desert critters outside Abigail's window.$7 It's his way of showing love, even if it's a bit gross.$3",
    
        "Blik.Science.01": "Blik tested gravity by pushing every single one of my gemstones off the shelf.$8 His scientific curiosity would be impressive if it weren't so annoying.$3",
    
        "Blik.Science.02": "Blik tested if my ink was permanent by spilling it all over my finished recipe book.$8 Turns out, yes, it's very permanent.$6",
    
        "Blik.Misunderstanding.01": "Had to rescue Blik from the Spirit's Eve maze after he destroyed half the decorations.$8 He was thrilled, Lewis was furious.$6",
    
        "Blik.Misunderstanding.02": "Blik brought me a 'gift' today—a piece of Clint's forge he somehow removed.$8 I'll have to return it with a lot of apologies and probably some money.$3",
        
    //Blik Token-Based Mischief Dialogue - Experimental
        "Blik.Mischief.Dynamic.01": "Blik targeted {{BlikTarget}}'s {{BlikItem}} today.$6 {{BlikMischief}} while {{BlikReaction}}.$3 {{BlikConsequence}}$1",
        
        "Blik.Mischief.Dynamic.02": "Found Blik in the {{BlikLocation}} earlier.$7 He was {{BlikMischief}} with incredible focus.$3 {{BlikTarget}} caught him in the act.$6 {{BlikConsequence}} Meanwhile, Blik just {{BlikReaction}}.$4",
        
        "Blik.Mischief.Dynamic.03": "$weather The {{weather:rainy:rain has made|snowy:snow has made|weather has made}} Blik extra mischievous today. He {{BlikMischief}} at {{BlikTarget}}'s place.$8 {{BlikConsequence}} Naturally, he {{BlikReaction}} afterward.$3",
        
        "Blik.Mischief.Dynamic.04": "$d {{Weekday}}#Mondays seem to inspire Blik's worst behavior.#Fridays bring out Blik's celebratory chaos.#Blik has been exceptionally busy today.# {{BlikTarget}} found him {{BlikMischief}} with their {{BlikItem}}.$6 When confronted, he simply {{BlikReaction}}.$1 {{BlikConsequence}}$3",
        
        "Blik.Mischief.Dynamic.05": "$season is Blik's favorite time for causing trouble with {{BlikItem}}s.$7 Today he {{BlikMischief}} at the {{BlikLocation}}.$6 {{BlikTarget}} was not amused.$8 {{BlikConsequence}} I'm beginning to think he plans these incidents.$3",

        "Blik.Mischief.Dynamic.06": "Blik's {{SivaTechTerm}} sensors must have malfunctioned today.$6 He targeted {{BlikTarget}}'s {{BlikItem}} and {{BlikMischief}} with unprecedented enthusiasm.$8 When I arrived, he {{BlikReaction}} as if everything was perfectly normal.$3 {{BlikConsequence}}$1",
        
        "Blik.Mischief.Dynamic.07": "I caught Blik studying {{SivaMineralReference}} formations at the {{BlikLocation}}.$4 Unfortunately, his 'research' involved {{BlikMischief}} with {{BlikTarget}}'s belongings.$6 {{BlikConsequence}} {{SivaWeatherComment}}$3",

        "Blik.Mischief.Dynamic.08": "@, I must {{Random:apologize|inform you|warn you}} about Blik's latest adventure.$6 He {{Random:found his way into|somehow accessed|broke into|discovered}} your {{Random:farmhouse|greenhouse|barn|coop|shed}} {{Random:yesterday|while you were away|this morning|last night}}.$8 {{Random:Nothing was damaged, fortunately.|He rearranged some things.|He left you a 'gift'.}} {{Random:I've had a stern talk with him.|He seems quite proud of himself.|This is becoming a concerning pattern.}}$3",

    //General Dailies 0 Hearts
        "Siva.Daily.01": "I have been observing the local fauna.$7 They exhibit remarkable adaptability to their environment.$0 I find it fascinating how they interact with their surroundings.$3",
        
        "Siva.Daily.02": "I have been experimenting with new recipes.$7 The local ingredients are quite different from what I am used to, but I am enjoying the challenge.$4",
        
        "Siva.Daily.03": "I have been studying the local flora.$7 The diversity of plant life here is astounding.$0 I find it inspiring for my culinary creations.$4",
        
        "Siva.Daily.04": "I have been practicing my cooking techniques.$7 The local ingredients are quite different from what I am used to, but I am enjoying the challenge.$4",
        
        "Siva.Daily.05": "I have been exploring the local area.$7 The landscapes are breathtaking and full of surprises.$0 I find it invigorating to discover new places.$4",

        "Siva.Daily.06": "Good day. I am conducting research on this region's mineral deposits.$0 Their luminous properties differ from my expectations.$3 Most scientifically intriguing.$1",
        
        "Siva.Daily.07": "I am Siva.$0 I prepare specialized culinary items for Mr. Qi.$1 I cannot discuss the details. Confidentiality agreement.$3",
        
        "Siva.Daily.08": "Oh, hello.$0 I am still adapting to local communication protocols.$3 Please excuse any... awkwardness in my interactions.$1",
        
        "Siva.Daily.09": "Greetings.$0 I am conducting taste analysis of your planetary light spectrum.$1 Not relevant to your interests, I'm certain.$3",
        
        "Siva.Daily.10": "You are the local agricultural specialist, correct?$0 Your cultivation methods are primitive but effective.$1 Fascinating adaptation to limited resources.$3",

    //General Dailies 2 Hearts
        "Siva.Daily.H2.01": "You again. I suppose your presence isn't entirely unwelcome.$3 There's a certain... reliability in your visits.$1 Not that I'm monitoring their frequency.$0",
        
        "Siva.Daily.H2.02": "Ah, the farmer.$3 I've noticed your agricultural methods are more sophisticated than I initially presumed.$0 Your dedication to this land is... commendable.$1",
        
        "Siva.Daily.H2.03": "I was just examining some local mineral samples.$0 They have unusual properties compared to... other places I've visited.$3 Not that you'd find that particularly interesting.$1",
        
        "Siva.Daily.H2.04": "Blik seems less hostile toward you than most visitors.$3 Curious development.$0 He typically shows better judgment of character than I do.$1",
        
        "Siva.Daily.H2.05": "I'm still adjusting to certain aspects of this region.$0 Some customs remain perplexing.$6 I appreciate your lack of intrusive questioning about my background.$3",
        
        "Siva.Daily.H2.06": "The light here has unusual qualities.$3 Not that I'm... studying it specifically.$6 Just a casual observation any chef would make.$0",
        
        "Siva.Daily.H2.07": "You have an unusual approach to conversation.$0 Less interrogative than others.$3 It's... refreshing.$1",
        
        "Siva.Daily.H2.08": "Qi speaks highly of your resourcefulness.$3 I'm beginning to understand why.$0 You have an adaptability that's quite... rare among your species.$1",

    //General Dailies 4 Hearts
        "Siva.Daily.H4.01": "I have been experimenting with new cooking techniques.$7 The local ingredients are quite different from what I am used to, but I am enjoying the challenge.$4",

        "Siva.Daily.H4.02": "I have been studying the local wildlife.$7 The diversity of animal life here is astounding.$0 I find it inspiring for my culinary creations.$4",

        "Siva.Daily.H4.03": "I have been practicing my baking techniques.$7 The local ingredients are quite different from what I am used to, but I am enjoying the challenge.$4",
        
        "Siva.Daily.H4.04": "Ah, @. Your presence is becoming... familiar.$7 It's strange how quickly one can form connections in an unfamiliar place.$3 I find it not entirely unpleasant.$4",
        
        "Siva.Daily.H4.05": "I've been analyzing the local quartz formations.$7 Did you know they can store different qualities of light?$0 I could demonstrate sometime if you're interested.$4",
        
        "Siva.Daily.H4.06": "Blik seems to enjoy your company.$7 He's usually quite discerning about humans.$0 You should consider it a compliment.$4",
        
        "Siva.Daily.H4.07": "The minerals you find in your mines have exceptional flavor profiles.$7 Not that I've been eating them, of course.$6 Just... professional observation.$3",
        
        "Siva.Daily.H4.08": "I've been cataloging the differences between this valley and my homeland.$7 The similarities are as surprising as the differences.$0 Both places have their own beauty.$4",

    // General Dailies 6 Hearts - Best Friend Dialog
        "Siva.Daily.H6.01": "I've been considering showing you my collection of crystallized light samples.$7 Few humans would understand their significance, but you... might.$10 Would that interest you?$4",

        "Siva.Daily.H6.02": "I told Blik about our conversation regarding stellar navigation.$7 He seemed pleased that someone here understands our perspective.$10 You're becoming quite the xenolinguist.$4",

        "Siva.Daily.H6.03": "Being around you makes this planet feel less foreign.$10 It's strange - I've traveled across galaxies, yet I've rarely felt as understood as I do with you.$7",
        
        "Siva.Daily.H6.04": "You know, @, I find myself looking forward to our conversations.$10 It's unexpected - forming a friendship wasn't in my original mission parameters.$7 But I'm glad for the deviation.$4",
        
        "Siva.Daily.H6.05": "I've started a small collection of Earth minerals with exceptional light-storage properties.$7 Would you like to see them sometime?$10 Your perspective might be... illuminating.$4",
        
        "Siva.Daily.H6.06": "I dreamt of my home planet last night.$6 Strange how a place can feel both missed and distant at the same time.$0 Your company helps with the adjustment.$10",
        
        "Siva.Daily.H6.07": "Qi asked why I spend time with a farmer.$0 I told him good ingredients come from understanding their source.$7 That's true, but not my only reason.$10",
        
        "Siva.Daily.H6.08": "The local children asked if I could show them a 'spaceship trick.'$6 I made a small stone glow by extracting its stored light.$10 Simple science, but they called it magic.$7",

    // General Dailies 8 Hearts - Dating Romantic Dialog
        "Siva.Daily.H8.01": "There's a phenomenon on my world where binary stars orbit so closely they share material.$10 I'm beginning to understand the poetry in that image when I'm with you.$4",

        "Siva.Daily.H8.02": "The light around you has a distinct signature.$10 It's become my favorite flavor on this planet.$4 I find myself craving it when you're away.$7",

        "Siva.Daily.H8.03": "I composed a light-poem about you yesterday.$7 In my culture, it's quite... intimate.$6 I'm not sure I'm ready to share it yet, but soon perhaps.$10",
        
        "Siva.Daily.H8.04": "@! My internal resonance frequencies increase when you're near.$4 That's... my species' equivalent of a quickened heartbeat.$10 You have a remarkable effect on me.$7",
        
        "Siva.Daily.H8.05": "Sometimes I wonder what would happen if I couldn't return home.$6 Then I realize that home might be less about a place and more about... being with you.$10 What a strange and wonderful realization.$4",
        
        "Siva.Daily.H8.06": "I told Blik yesterday that you're becoming essential to my happiness.$10 He pretended indifference, but I noticed he left his favorite crystal by your door.$7 He's welcoming you into our family in his own way.$4",
        
        "Siva.Daily.H8.07": "I've been capturing the light from moments we've shared together.$7 When combined, they create a flavor profile unlike anything I've experienced.$10 Sweet, complex, and... increasingly necessary to me.$4",
        
        "Siva.Daily.H8.08": "Did you know that on my world, sharing light is considered deeply intimate?$6 When our hands touch and I feel that warmth...$10 Well, let's just say it's more meaningful than you might realize.$4",

    //General Dailies 10 Hearts
        "Siva.Daily.H10.01": "Ah, my dear friend!$10 I was just thinking about the remarkable journey that brought us together.$4 From stranger to trusted confidant - an extraordinary transformation.$7",
        
        "Siva.Daily.H10.02": "I've been composing a culinary memoir of my time here.$7 You feature prominently - the human who saw past my oddities and offered friendship.$10 It's my most meaningful work.$4",
        
        "Siva.Daily.H10.03": "Blik and I were discussing how much has changed since we arrived.$6 I came seeking repairs for my ship, but found something far more valuable.$10 A connection I never expected.$4",
        
        "Siva.Daily.H10.04": "Last night I prepared a dish using light captured from our first real conversation.$4 It tasted of uncertainty transformed into trust.$10 The most exquisite flavor this planet has offered me.$7",
        
        "Siva.Daily.H10.05": "On my world, we have a saying: 'The universe places us where we need to learn, not where we plan to go.'$7 I understand that wisdom more deeply now.$10 Thank you for being part of my unexpected journey.$4",
        
        "Siva.Daily.H10.06": "When I first landed here, I saw only a primitive planet with limited resources.$6 Now I see the richness I nearly missed - the connections, the community.$10 You helped change my perspective entirely.$4",
        
        "Siva.Daily.H10.07": "I've started teaching Blik to bring you only living gifts.$7 He's trying, though his concept of 'gift' remains unconventional.$10 Your patience with us both means more than I can express.$4",
        
        "Siva.Daily.H10.08": "If my people could taste the light we've shared here,$10 they would understand why returning home has become... a complicated prospect.$7 Some discoveries change us fundamentally.$4",

    // Spousal Dialog (After Marriage)
        "Siva.Spouse.01": "On my world, exclusive partnerships are uncommon.$7 But for you, I've chosen this path willingly.$10 The light we create together is worth any cultural adjustment.$4",
        
        "Siva.Spouse.02": "I've modified my circadian rhythm to match yours.$7 It's fascinating how quickly one's physiology adapts when there's sufficient motivation.$10 Sharing mornings with you is... most agreeable.$4",
        
        "Siva.Spouse.03": "Blik rearranged our belongings last night.$6 He's still adjusting to our union.$7 In my culture, pets are considered equal members of any partnership.$10 He'll come around to the idea of sharing me.$4",
        
        "Siva.Spouse.04": "This morning, I captured the light from our shared breakfast.$10 In my culture, couples maintain a collection of significant moments.$7 Our collection is growing quite beautiful.$4",
        
        "Siva.Spouse.05": "I informed Qi of our pairing.$7 He seemed amused but offered congratulations.$10 He suggested our 'cultural exchange' was more successful than anticipated.$4 I didn't correct his understatement.$10",
        
        "Siva.Spouse.06": "I've noticed my bioluminescence increases when you're near.$6 It's rather... revealing of my emotional state.$10 Like an involuntary blush, but more radiant.$4 Just another way I can't hide my feelings from you.$7",
        
        "Siva.Spouse.07": "Your farming work fascinates me.$7 On my world, we synthesize nutrients, not grow them.$10 There's something deeply satisfying about watching you nurture life from this soil.$4 I'm learning much from you.$10",
        
        "Siva.Spouse.08": "This partnership ritual of sharing a dwelling is surprisingly agreeable.$7 The constant proximity allows me to sample the light you emanate throughout the day.$10 It has become my favorite sustenance.$4",
        
        "Siva.Spouse.09": "In my culture, we don't have a concept of 'marriage' exactly.$0 We speak instead of 'resonant frequencies' - beings whose energy patterns harmonize.$10 Ours harmonize more perfectly than any I've experienced.$4",
        
        "Siva.Spouse.10": "I dreamt of my home world last night.$6 For the first time, I didn't feel homesick upon waking.$10 Because home was right beside me.$4 An unexpected but welcome development.$7",
        
        "Siva.Spouse.11": "Qi asked when I plan to return to my world.$0 I told him my mission parameters have... evolved.$10 Some discoveries are too precious to abandon.$4 I hope you don't mind that I plan to stay.$7",
        
        "Siva.Spouse.12": "This morning, I tried preparing you a traditional Earth breakfast.$7 Blik 'helped' by rearranging everything.$6 The result was... unconventional.$10 But your appreciation meant everything.$4",
        
        "Siva.Spouse.13": "I created something for you.$10 A crystal that captures our shared light signature.$4 In my culture, it's equivalent to what you call a wedding ring.$7 A physical manifestation of our connection.$10",
        
        "Siva.Spouse.14": "I've sent a transmission to my homeworld about you.$7 They're quite curious about the human who changed my perspective on Earth.$10 I may have spoken about you at... considerable length.$4",
        
        "Siva.Spouse.15": "There's an old saying where I come from: 'Find the being whose light complements yours.'$10 I never understood it until now.$4 We are different wavelengths that create something beautiful together.$7",
        
        "Siva.Spouse.16": "I may never fully adapt to all Earth customs,$6 but waking up beside you makes even the strangest of them worthwhile.$10 You've made this alien feel at home.$4"
}

/*
Siva's Heart Events: The Light Gourmet
    
Event Summary List

0-Heart Event: The Medical Emergency
    Location: Clinic or Desert
    Scene: Farmer offers to call a doctor when Siva is injured or ill
    Plot: Siva admits he can't see a human doctor because his physiology is different
    Dialogue: "Please don't call anyone. I... I know this must come as a great shock, but my internal organs aren't arranged like yours."
    Dialogue Options for Farmer:
        "It was pretty obvious, actually. You've been drinking saltwater like it's soda and your skin is blue."
            "So you can see my true form then. Concerning, but I have noticed some of the children commenting on my appearance. Perhaps my cloaking technology isn't as universal as I'd presumed..."
        "An ALIEN? That's... that's impossible!"
            "Oh, so forest spirits and talking animals you accept, but you draw the line at extra terrestrial visitors?"
        "Are you dangerous? Should I be worried?"
            "Yes, I'm one of many from a alien attack force that was meant to scout this place and ... okay, stop hyperventilating, this is a joke. I'm not dangerous. I'm just... different."
    Resolution: Farmer helps Siva find a solution, deepening trust as Siva shows vulnerability about his non-human limitations

2-Heart Event: Salt & Light
    Location: Beach or Saloon
    Scene: Player discovers Siva examining salt with great curiosity
    Plot: Siva is fascinated by humans' casual consumption of minerals, studying salt specifically
    Dialogue: "You humans consume sodium chloride daily without ceremony, yet it's quite remarkable—it captures and preserves the memory of ancient seas and sunlight. A rather... pedestrian flavor profile, but impressively efficient for your species."
    Resolution: Siva shares insights about how different preparation methods affect salt's "light retention," treating it like humans would discuss wine aging

4-Heart Event Option 4: Adaptation Challenges
    Location: Clinic or Desert
    Scene: Siva struggling with an Earth-specific environmental challenge
    Plot: He's developed a reaction to something common on Earth (pollen, water composition, etc.)
    Dialogue: While dealing with this challenge, Siva reveals more about his physical nature and adaptation strategies
    Resolution: The player helps him find a solution, deepening trust as Siva shows vulnerability about his non-human limitations

6-Heart Event: Qi's Menu
    Location: Casino kitchen
    Scene: Siva preparing specialized "dishes" from minerals while talking about Qi
    Plot: Through his cooking process, Siva reveals more about his complicated relationship with Qi
    Dialogue: "Qi provides these basic ingredients, but they're hardly the quality I'm accustomed to. Like offering a chef nothing but potatoes and expecting gourmet cuisine. Still... one adapts. The universal skill of the displaced."
    Resolution: Despite his complaints, Siva creates something beautiful, showing his resilience and creativity even with limited resources

8-Heart Event Option 3: Blik's Mischief
    Location: Town or forest
    Scene: Blik has gotten into trouble with the local wildlife/townspeople
    Plot: Siva and the player must track down Blik and fix whatever chaos he's caused
    Dialogue: While solving the problem, Siva reveals more about his and Blik's relationship - how they found each other, their journeys together, and their unusual bond
    Resolution: Once Blik is safely retrieved, Siva shows a vulnerable moment of attachment, admitting that despite Blik's troublesome nature, he's the closest thing to family Siva has in this corner of the universe

10-Heart Event: Blik's Special Diet
    Location: Desert at night
    Scene: Blik appears unwell, refusing regular "food"
    Plot: Siva explains that Blik needs a specific combination of minerals and light that's rare on Earth
    Dialogue: "Blik's palate is even more specialized than mine. He requires light that's been filtered through selenium crystals under specific stellar alignments. On our world, it's common. Here... well, I've been improvising."
    Resolution: Player helps find a rare mineral that, when processed by Siva, creates exactly what Blik needs, strengthening the bond between all three

14-Heart Event: The Memory Feast
    Location: A special location meaningful to your friendship
    Scene: Siva has prepared his masterpiece—a dish capturing the specific light of significant moments
    Plot: Using locations you've visited together, Siva has collected and preserved the unique light signatures
    Dialogue: "In my culture, we preserve important relationships by capturing and consuming the light of shared moments. This crystal contains the sunset from the beach when we first really talked. This one, the moonlight from the night we helped Blik. Together, they tell our story."
    Resolution: Siva shares that this is the most meaningful "meal" he's prepared on Earth—one that contains genuine connection rather than just sustenance

Example Daily Dialogues
Regular Day Dialogues
    "I sampled a particularly exquisite sunrise this morning. Notes of hope with a crisp, clear finish. The desert truly produces the most interesting light vintages.$4"
    "Your miners discard iron pyrite as worthless 'fool's gold.' Quite shortsighted.$3 When properly prepared, it delivers a robust, spicy profile with notes of afternoon sunlight.$7"
    "Do humans truly not taste the difference between fluorescent and incandescent lighting? How... limiting.$6 Like living in a world where all music sounds identical.$0"
    "Blik brought me a firefly yesterday. Their light has a delightful, effervescent quality—organic and unpredictable.$10 Rather like your human concept of 'street food.'$3"

Season-Specific Dialogues
    Spring: "Spring sunlight has a particular freshness to it. Bright, with grassy undertones and a hint of pollen.$7 Quite invigorating after winter's heavy, aged flavors.$4"
    Summer: "Summer noon light is almost too intense—the culinary equivalent of your 'extra spicy' food.$6 I've been collecting it in small doses for Blik, who lacks my refined palate.$3"
    Fall: "The light filtered through autumn leaves creates a remarkable amber vintage.$10 Complex, nostalgic, with notes of decay that paradoxically celebrate life's cycle.$7"
    Winter: "Moonlight reflected off fresh snow is a rare delicacy.$4 Clean, pure, with crystalline overtones. I've been aging some in quartz for a special occasion.$1"

Weather-Specific Dialogues
    Rainy: "Raindrops fracture sunlight in the most fascinating ways.$7 Each droplet becomes a tiny prism, creating microbursts of flavor. Nature's molecular gastronomy.$4"
    Thunderstorm: "Lightning contains the most complex flavor profile on your planet.$9 Intense, electric, with a sharp metallic finish. Too powerful to consume directly—I filter it through selenite.$0"
    Foggy: "Fog creates the most interesting light infusion—sunlight steeped in water vapor.$3 Muted, mysterious, with subtle variations throughout. Like your tea, but with photons.$1"

Location-Specific Dialogues
    Mines: "The bioluminescent mushrooms down here produce a surprisingly sophisticated light.$7 Earthy, with umami undertones and a gentle finish. Quite the local specialty.$4"
    Beach: "Sunlight reflected off ocean waves has a briny, bright character.$3 The salt content in the air adds a distinctive minerality to the finish. Your world's terroir at work.$1"
    Wizard's Tower: "The magical illumination here contains flavor notes I've never encountered.$0 Like tasting a new spice for the first time... intriguing, yet difficult to categorize.$7"
*/